#"brew bundle install" after update
#"brew bundle cleanup --force" after delete

tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "oven-sh/bun"
tap "jesseduffield/lazygit"

#brew
brew "bun"
brew "colima"
brew "docker"
brew "docker-compose"
brew "eslint"
brew "fd"
brew "flyctl"
brew "fzf"
brew "gh"
brew "gradle"
brew "gradle-completion"
brew "lazygit"
brew "maven"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "node@18"
brew "npm"
brew "nvm"
brew "pnpm"
brew "prettier"
brew "starship"
brew "thefuck"

#cask
cask "1password"
cask "alt-tab"
#cask "arc"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "google-cloud-sdk"
#cask "intellij-idea"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "notion"
cask "postman"
#cask "rectangle"
cask "scroll-reverser"
#cask "slack"
cask "spotify"
#cask "visual-studio-code"
