#"brew bundle install" after update
#"brew bundle cleanup --force" after delete

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

#brew
brew "colima"
brew "docker"
brew "docker-compose"
brew "fd"
brew "flyctl"
brew "gh"
brew "gradle"
brew "gradle-completion"
brew "graphviz"
brew "maven"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "node@18"
brew "pnpm"
brew "starship"
brew "telnet"
brew "thefuck"
brew "heroku/brew/heroku"

#cask
cask "1password"
cask "alt-tab"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "google-cloud-sdk"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "notion"
cask "postman"
cask "rectangle"
cask "scroll-reverser"
cask "slack"
cask "spotify"
